import Data.List (sortOn)
-- raman0ujan 拉马努金的1729的故事
-- 1729 = 1 ^ 3 + 12 ^ 3 = 9 ^ 3 + 10 ^ 3

-- 搜索下一个序列
-- 这里如何定义下一个，是一个非常微妙的问题
-- 如果按照Haskell的Ord定义，那么我们可以固定a为1，继续搜索，
-- 那么下一个序列就是
-- (1, 103, 64, 94) => 1 ^ 3 + 103 ^ 3 = 64 ^ 3 + 94 ^ 3 = 1092728

-- 如果反而限定为a^3+b^3来作为顺序的话，
-- 则是4104 = 2 ^ 3 + 16 ^ 3 = 9 ^ 3 + 15 ^ 3 < 17 ^ 3
-- 因此只需要将n放宽到17，然后在全面搜索就可以了

raman0 n = [(a, b, c, d) | a <- [1]
                         , b <- [(a + 1)..n]
                         , c <- [(a + 1)..n]
                         , d <- [(c + 1)..n]
                         , a ^ 3 + b ^ 3 == c ^ 3 + d ^ 3]

raman1 n = sortOn (\(a, b, _, _) -> a ^ 3 + b ^ 3) xs
    where xs = [(a, b, c, d) | a <- [1..n]
                             , b <- [(a + 1)..n]
                             , c <- [(a + 1)..n]
                             , d <- [(c + 1)..n]
                             , a ^ 3 + b ^ 3 == c ^ 3 + d ^ 3]

main = do
        print $ (raman0 200) !! 1
        print $ (raman1 17) !! 1
